const sum = require('./script');

// Тестирование функции при помощи пакета Jest
test('ввод набора чисел: [14, 15, 16, 17, 8, 9, 10, 11, 2] ответ должен быть 10', () => {
	expect(sum([14, 15, 16, 17, 8, 9, 10, 11, 2])).toBe(10);
});

test('ввод набора чисел и строк: ["aaa", "hye, sk???", "5", 1, 55] ответ должен быть 56', () => {
	expect(sum(["aaa", "hye, sk???", "5", 1, 55])).toBe(56);
});

test('ввод набора отрицательных чисел: [-3, -2, -1, 0, 1, 2, 3] ответ должен быть -5', () => {
	expect(sum([-3, -2, -1, 0, 1, 2, 3])).toBe(-5);
});

test('ввод набора строк: ["aaa", "hye, sk???", "5"] результатом должно быть порождение исключения', () => {
	
	function testdrive() {
			sum(["aaa", "hye, sk???", "5"]);
		}
	expect(testdrive).toThrow();
	
});

test('пустой массив результатом должно быть порождение исключения', () => {
	
	function testdrive() {
			sum([]);
		}
	expect(testdrive).toThrow();
	
});